RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
  /* Reset CFGR2 register */
  RCC->CFGR2 = 0x00000000;
#elif defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || (defined STM32F10X_HD_VL)
  /* Disable all interrupts and clear pending bits  */
  RCC->CIR = 0x009F0000;

  /* Reset CFGR2 register */
  RCC->CFGR2 = 0x00000000;      
#else
  /* Disable all interrupts and clear pending bits  */
  RCC->CIR = 0x009F0000;
#endif /* STM32F10X_CL */
    

  /* Configure the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers */
  /* Configure the Flash Latency cycles and enable prefetch buffer */
  app_SetSysClock();
	
	SystemCoreClockUpdate();


//Vector Table base offset field.This value must be a multiple of 0x200.
#ifdef VECT_TAB_SRAM
  SCB->VTOR = SRAM_BASE | 0; /* Vector Table Relocation in Internal SRAM. */
#else
  SCB->VTOR = FLASH_BASE | 0; /* Vector Table Relocation in Internal FLASH. */
#endif 
}





void Uart_USB_SWJ_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	
	//USART1								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); 

	Uart_Configuration (&Uart1, USART1, 115200, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);
	
#if 0
	//USART2								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	
	Uart_Configuration (&Uart2, USART2, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);
#endif

#if 1
	//USART3								  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
    										  
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOB, &GPIO_InitStructure); 
	
	Uart_Configuration (&Uart3, USART3, 57600, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No);
	
#endif
	
	//swd
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	
	
#if BOARD_HAS_IAP
	#if IAP_PORT_USB 
	iap_init_in_usb();
	#endif
	#if IAP_PORT_CAN1
	iap_init_in_can1();
	#endif
	#if  IAP_PORT_UART
	iap_init_in_uart( IAP_UART );
	#endif
#endif

	console_init( CONSOLE_UART_TYPE ,CONSOLE_UART );
	console_init( CONSOLE_USB_TYPE ,NULL );
	
}






//protocol msg packget  [tag][data]
// tag: high 4 bits is fixed for packget type
//      low 4 bits is for custom
#define PMSG_TAG_ACK		0x10
#define PMSG_TAG_LOG		0x20
#define PMSG_TAG_DATA		0x30
#define PMSG_TAG_CMD		0x40
#define IS_PMSG_TAG(T,V) (( V & 0xf0 ) == T)


typedef struct _PMSG_msg_t{
	unsigned char tag;
	unsigned char data[PROTOCOL_MAX_PACKET_SIZE];
	int data_len;
}PMSG_msg_t;

//transmit func : for sending , return the number sent; for reading , return the number read which data in *data, data len in len
typedef int (*PMSG_transmit_handler_type)( unsigned char *data, int len );
typedef void (*PMSG_msg_handler_type)( PMSG_msg_t msg);


Uart_t *pUart;
PMSG_transmit_handler_type _PMSG_sendbytes_handler;
PMSG_transmit_handler_type _PMSG_readbytes_handler;
PMSG_msg_handler_type _PMSG_msg_handler;
protocol_t PMSG_decoder;
protocol_t PMSG_encoder;
PMSG_msg_t PMSG_msg;

//the lowest send bytes function
void _PMSG_send_bytes( unsigned char *data, int len)
{
	if( pUart != NULL ){
		Uart_Put(pUart, data, len);
	}
	if( _PMSG_sendbytes_handler != NULL ){
		_PMSG_sendbytes_handler(data, len);
	}
}

// check one byte for msg, if get one , fill in msg and return 1, else 0
int PMSG_parse_byte( unsigned char data , PMSG_msg_t *msg )
{
	if( 1 == protocol_parse( &PMSG_decoder , data ) )
	{
		msg->tag = PMSG_decoder.data[0];
		if( PMSG_decoder.len > 1 ){
			msg->data_len = PMSG_decoder.len-1;
			memcpy( msg->data, PMSG_decoder.data+1, msg->data_len);
		}else{
			msg->data_len = 0;
		}
		
		return 1;
	}
	return 0;
}



// read data  and if get one , fill in msg and return 1, else 0
int PMSG_receive_msg( PMSG_msg_t *msg )
{
	unsigned char val;
	int len, i;
	
	if( _PMSG_readbytes_handler != NULL )
	{
		for( i=0 ;i < PROTOCOL_MAX_PACKET_SIZE ; i++)
		{
			if( 1 == _PMSG_readbytes_handler( &val,1 ) ){
				if( 1 == PMSG_parse_byte( val, msg ) )
				{
					return 1;
				}
			}else{
				break;
			}
			
		}
	}
	
	if( pUart != NULL  )
	{
		for( i=0 ;i < PROTOCOL_MAX_PACKET_SIZE ; i++)
		{
			if( 1 == Uart_Get(pUart,&val,1 ) ){
				if( 1 == PMSG_parse_byte( val, msg ) )
				{
					return 1;
				}
			}else{
				break;
			}
			
		}
	}
	return 0;
}

int PMSG_send_msg( unsigned char tag, unsigned char *data, int len)
{
	unsigned char packget[PROTOCOL_MAX_PACKET_SIZE];
	
	if( len > (PROTOCOL_MAX_PACKET_SIZE - 1) ) return 0;
	
	packget[0] = tag;
	memcpy( &packget[1] , data, len);
	if( 0 == protocol_encode( &PMSG_encoder, packget, len+1) ) return 0;
	_PMSG_send_bytes( PMSG_encoder.data, PMSG_encoder.len );
	return 1;
}


// init , can use uart or customed send and receive interface , if no avaliable , set NULL 
void PMSG_init( Uart_t *uart , PMSG_msg_handler_type msg_func, PMSG_transmit_handler_type sendbytes_func , PMSG_transmit_handler_type  readbytes_func)
{
	pUart = uart;
	_PMSG_sendbytes_handler = sendbytes_func;
	_PMSG_readbytes_handler = readbytes_func;
	_PMSG_msg_handler = msg_func;
	protocol_init( &PMSG_decoder );
	protocol_init( &PMSG_encoder );
}


// user can ignore this even() , you can use PMSG_receive_msg() or PMSG_parse_byte() to get the msg and then deal with them yourselve
void PMSG_even()
{
	
