RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
	if( _PMSG_msg_handler == NULL ) return;
	
	if( 1 == PMSG_receive_msg( &PMSG_msg ) )
	{
		_PMSG_msg_handler( PMSG_msg );
	}
}




//for example 

#define PC_TAG_LOGE  (PMSG_TAG_LOG|0x1)
#define PC_TAG_LOGI  (PMSG_TAG_LOG|0x2)

unsigned char logbuffer[ PROTOCOL_MAX_PACKET_SIZE ];
#define PC_LOG(T, X...) { snprintf( logbuffer, sizeof( logbuffer ), X);  PMSG_send_msg( T , logbuffer, strlen(logbuffer) ); }
#define PC_LOGI(X...) PC_LOG( PC_TAG_LOGI , X)
#define PC_LOGE(X...) PC_LOG( PC_TAG_LOGE , X)


#define PC_TAG_CMD_CAPTURE_EN  (PMSG_TAG_CMD | 0x01 ) // data[0] = 1 auto start, data[0] = 0 stop
#define PC_TAG_CMD_LED_SELECT  (PMSG_TAG_CMD | 0x02 )  // data[0] = led id [1~12], data[1] = status
#define PC_TAG_CMD_CAPTURE_INTERVAL  (PMSG_TAG_CMD | 0x03 )  //data[0] = ms_L, data[1] = ms_H
#define PC_TAG_CMD_TEST (PMSG_TAG_CMD | 0x04 ) 
#define PC_TAG_CMD_SWITCHES_TESTMODE (PMSG_TAG_CMD | 0x05 ) // data[0] = 2,3,4,5 , FF mean off all
#define PC_TAG_CMD_SWITCHES_CHANNEL (PMSG_TAG_CMD | 0x06 ) // data[0] = 0~15 , FF mean off all


#define PC_TAG_DATA_LED_BRIGHTNESS (PMSG_TAG_DATA|0x1)











#define CAPTURE_IDEL			0
#define CAPTURE_STARTED		1
#define CAPTURE_FINISH		2
volatile unsigned int capture_time_ms	= 5 ;  // [ 0.1ms, 600ms ]
volatile unsigned int capture_1to6_tickers = 0;
volatile unsigned int capture_1to6_periods = 0;

volatile unsigned int capture_7to12_tickers = 0;
volatile unsigned int capture_7to12_periods = 0;

unsigned int capture_timer_period = 0xffff;
volatile int capture_counter_status = CAPTURE_IDEL;


void capture_counter_timer_init(TIM_TypeDef *timer)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

	TIM_TimeBaseStructure.TIM_Period = capture_timer_period-1;
	TIM_TimeBaseStructure.TIM_Prescaler = 1-1;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(timer, &TIM_TimeBaseStructure);
	TIM_ITConfig(timer, TIM_IT_Update, ENABLE);
	TIM_ARRPreloadConfig(timer, DISABLE);
	
	//TIM_ITRxExternalClockConfig(timer,TIM_TS_ETRF);
	TIM_ETRClockMode2Config(timer, TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted, 0);
	//TIM_SelectInputTrigger(timer, TIM_TS_ETRF);
	
	TIM_ClearITPendingBit(timer, TIM_IT_Update);
	TIM_SetCounter(timer, 0);
	//TIM_Cmd(timer, ENABLE);
	
}

void cpature_counter_reset_interval( int ms)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
	if( ms > 600 ) return ;
	
	TIM_Cmd(TIM3, DISABLE);
	TIM_TimeBaseStructure.TIM_Period = (100*ms)-1;
	TIM_TimeBaseStructure.TIM_Prescaler = 720-1;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
	TIM_ARRPreloadConfig(TIM3, DISABLE);
	TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
	
	capture_time_ms = ms;
}

void capture_counter_init()
{
	GPIO_InitTypeDef GPIO_InitStructure; 
	NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_0; 
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;//GPIO_Mode_IN_FLOATING; 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
	GPIO_Init(GPIOA, &GPIO_InitStructure); 
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);	
	capture_counter_timer_init(TIM2);

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
	capture_counter_timer_init(TIM1);
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	cpature_counter_reset_interval(capture_time_ms);
	
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
	
	// Enable the Interrupt
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM1_UP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
	NVIC_InitStructure.NVIC_IRQChannel                        = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority      = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority             = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd                     = ENABLE;
	NVIC_Init(&NVIC_InitStructure);	
	
}

void TIM2_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) 
	{
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update );
		capture_1to6_periods++;
	}
}

void TIM1_UP_IRQHandler()
{
	if (TIM_GetITStatus(TIM1, TIM_IT_Update) != RESET) 
	{
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update );
		capture_7to12_periods++;
	}
}


void TIM3_IRQHandler(void)
{
	if (TIM_GetITStatus(TIM3, TIM_IT_Update) != RESET) 
	{
		
		TIM_Cmd(TIM2, DISABLE);
		TIM_Cmd(TIM1, DISABLE);
		
		capture_1to6_tickers = TIM_GetCounter(TIM2);
		capture_7to12_tickers = TIM_GetCounter(TIM1); 
		capture_1to6_tickers += ( capture_1to6_periods * capture_timer_period );
		capture_7to12_tickers += ( capture_7to12_periods * capture_timer_period );
		capture_counter_status = CAPTURE_FINISH;
		
		TIM_ClearITPendingBit(TIM3, TIM_IT_Update );
		TIM_Cmd(TIM3, DISABLE);
	}
	
}


void capture_counter_stop()
{
	TIM_Cmd(TIM3, DISABLE);
	TIM_Cmd(TIM2, DISABLE);
	TIM_Cmd(TIM1, DISABLE);
	capture_counter_status = CAPTURE_IDEL;
}

void capture_counter_start()
{
	capture_counter_stop();
	
	capture_1to6_tickers = 0;
	capture_1to6_periods = 0;
	capture_7to12_tickers = 0;
	capture_7to12_periods = 0;
	capture_counter_status = CAPTURE_STARTED;
	
	TIM_SetCounter(TIM2, 0);
	TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	TIM_Cmd(TIM2, ENABLE);
	
	TIM_SetCounter(TIM1, 0);
	TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
	TIM_Cmd(TIM1, ENABLE);
	
	TIM_SetCounter(TIM3, 0);
	TIM_ClearITPendingBit(TIM3, TIM_IT_Update);
	TIM_Cmd(TIM3, ENABLE);
}

int capture_counter_check(int *freq1_6, int *freq_7_12)
{
	if( capture_counter_status == CAPTURE_FINISH )
	{
		*freq1_6 = capture_1to6_tickers *1000 / capture_time_ms ;// HZ
		*freq_7_12 = capture_7to12_tickers *1000 / capture_time_ms ;// HZ
		capture_counter_stop();
		return 1;
	}
	return 0;
}








