RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
typedef enum _LED_ID {
	LED1 = 0,
	LED2,LED3,LED4,LED5,LED6,LED7,LED8,LED9,LED10,LED11,LED12	
}LED_ID_Type;

volatile unsigned char led_regs[12];
volatile unsigned char led_regs_feedback[12];
volatile unsigned char led_update_status;
volatile unsigned char led_current_id;

#define LED_STATUS_ENABLE			0x00
#define LED_STATUS_DISABLE		0x02
#define LED_STATUS_COLOR_RED				0x00
#define LED_STATUS_COLOR_GREEN			0x0C
#define LED_STATUS_COLOR_BLUE				0x04
#define LED_STATUS_COLOR_CLEAR				0x08
#define LED_STATUS_FREQ_100		0x30
#define LED_STATUS_FREQ_20		0x10
#define LED_STATUS_FREQ_2			0x20
#define LED_STATUS_FREQ_OFF			0x00
#define LED_STATUS_LED_ON				0x00
#define LED_STATUS_LED_OFF				0x01

#define LED_STATUS_OK  1
#define LED_STATUS_NG   0

#define LED_SERIAL_INPUT(X) GPIO_WriteBit( GPIOB, GPIO_Pin_4 , X)
#define LED_SERIAL_nEN(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_5 , X)
#define LED_SERIAL_LOCK(X)  GPIO_WriteBit( GPIOB, GPIO_Pin_6 , X)
#define LED_SERIAL_CLK(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_7 , X)
#define LED_SERIAL_REGCLR(X)   GPIO_WriteBit( GPIOB, GPIO_Pin_8 , X)
#define LED_SERIAL_OUTPUT() GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_3)

#define LED_HAS_SERIAL_74HC595    1  // if using the 74HC595 


void _sn74hc595_delay_nop()
{
	volatile int i=36;
	while( i-- > 0 ) __NOP();
	//systick_delay_ms(1);
}

void _sn74hc595_update_regs()
{
	int i ,index;
	unsigned char reg;
	unsigned char reg_feedback;
	
	
	for( i = LED12; i >= LED1; i-- )
	{
		reg = led_regs[i];
		reg_feedback = 0;
		for( index = 0; index < 6 ; index++)
		{
			LED_SERIAL_INPUT( (reg>>index) & 0x1 );
			LED_SERIAL_CLK(0);
		  _sn74hc595_delay_nop();
			LED_SERIAL_CLK(1);
			_sn74hc595_delay_nop();
			reg_feedback = (reg_feedback<<index) | LED_SERIAL_OUTPUT();
		}
		led_regs_feedback[LED12-i] = reg_feedback;
	}
}


/*
update the store reg
if return 0 sussefuly , -1 failed
*/
int catpure_select_update_led_status()
{
	int i,retry,res;
	
	if( 0 == LED_HAS_SERIAL_74HC595 ){
		// tsc3200 is control by hardware
		led_update_status = LED_STATUS_OK;
		return 0;
	}
	
	//clear shift reg
	LED_SERIAL_REGCLR(0);
	systick_delay_ms(1);
	LED_SERIAL_REGCLR(1);
	
	//shift data
	retry  =  4; // at less 2 times
	while( 0 < retry-- )
	{
		_sn74hc595_update_regs();
		res = 1;
		for( i = LED1; i<= LED12; i++ )
		{
			if( led_regs[i] != led_regs_feedback[i] ){
				res = 0;
				break;
			}
		}
		if( res = 1 ) break;
	}

	if( res == 1 )
	{
		//store to sotre reg
		LED_SERIAL_LOCK(0);
		_sn74hc595_delay_nop();
		LED_SERIAL_LOCK(1);
		// enable output
		LED_SERIAL_nEN(0); 
		
		led_update_status = LED_STATUS_OK;
	}else{
		led_update_status = LED_STATUS_NG;
	}
	
	return res==1 ? 0:-1;
}

void capture_select_set_led_status(LED_ID_Type led, unsigned char status)
{
	led_regs[ led ] = status;
}


void capture_select_led_output( LED_ID_Type led )
{
	if( led >= LED1 && led <= LED6 )
	{
		GPIO_WriteBit( GPIOB, GPIO_Pin_0 , (led&0x1) );
		GPIO_WriteBit( GPIOB, GPIO_Pin_1 , (led&0x2)>>1 );
		GPIO_WriteBit( GPIOB, GPIO_Pin_2 , (led&0x4)>>2 );
	}else if ( led >= LED7 && led <= LED12 ){
		led -= 6 ;
		GPIO_WriteBit( GPIOA, GPIO_Pin_8 , (led&0x1) );
		GPIO_WriteBit( GPIOA, GPIO_Pin_7 , (led&0x2)>>1 );
		GPIO_WriteBit( GPIOA, GPIO_Pin_6 , (led&0x4)>>2 );
	}
}

//select led output and update the control pin of that tsc3200; successfully return 0, falied -1
int capture_select_led( LED_ID_Type led , unsigned char ctlparam)
{
	led_current_id = led;
	capture_select_led_output(led);
	if( ctlparam != led_regs[led] || led_update_status == LED_STATUS_NG ){
		capture_select_set_led_status(led,  ctlparam);
		return catpure_select_update_led_status();
	}
	return 0;
}

void catpure_select_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	int i;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);

	//74h151 , output select
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_OD ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_7 | GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	capture_select_led_output(LED1);
	capture_select_led_output(LED7);
	
	//74h595 , led status control 
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_IN_FLOATING ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	LED_SERIAL_nEN(1); // high , output disabled
	LED_SERIAL_REGCLR(1); // low , shift reg clear
	LED_SERIAL_LOCK(0); // rise to triggle locking , so prepare now
	LED_SERIAL_CLK(0);
	
	for( i = LED1; i<= LED12; i++ ){
		capture_select_set_led_status( i,  LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_OFF );
	}
	catpure_select_update_led_status();
	if ( LED_STATUS_NG ==  led_update_status){
		_LOGE("update 74hc595 reg failed\n");
	}
	
}







volatile unsigned int led_brightness[12];
volatile int auto_capture_index;
volatile int auto_capture_en;

void capture_reset_led_brightness()
{
	int i=0;
	for( i=0; i< 12; i++)
	{
		led_brightness[i] = 0;
		capture_select_set_led_status( i,  LED_STATUS_DISABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_OFF );
	}
	auto_capture_index = LED1;
}


//tim 3 period , 0.1~500ms
void capture_set_interval( int ms ) 
{
	if( capture_counter_status != CAPTURE_IDEL ) {
		capture_counter_stop();
		cpature_counter_reset_interval( ms );
		capture_counter_start();
	}else{
		cpature_counter_reset_interval( ms );
	}
}

void capture_auto_mode()
{
	capture_counter_stop();
	capture_reset_led_brightness();
	auto_capture_en  = 1;
}

void capture_manual_mode()
{
	capture_counter_stop();
	auto_capture_en  = 0;
	capture_reset_led_brightness();
}

