RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
void capture_init()
{
	capture_reset_led_brightness();
	catpure_select_init();
	capture_counter_init();
	
	if ( LED_STATUS_NG ==  led_update_status){
		PC_LOGE("init 74hc595 reg failed\n");
	}
	capture_manual_mode();
}

void capture_loop()
{
	int freq1=0,freq2=0,res;
	
	if( auto_capture_en == 0) 
	{
		//manual mode  or falied select led
		if( 1 == capture_counter_check(&freq1, &freq2) )
		{
			if( led_current_id >= 0 && led_current_id< 6 ){
				led_brightness[led_current_id] = freq1;
			}else{
				led_brightness[led_current_id] = freq2;
			}
			PMSG_send_msg( PC_TAG_DATA_LED_BRIGHTNESS , (unsigned char *)led_brightness , sizeof(led_brightness) ); 
			capture_counter_start();
		}
		return;
	}
	
	//check if get bringthness
	if( 1 == capture_counter_check(&freq1, &freq2) )
	{
		led_brightness[auto_capture_index] = freq1;
		led_brightness[auto_capture_index+6] = freq2;
		capture_select_set_led_status(auto_capture_index,  led_regs[auto_capture_index]| LED_STATUS_LED_OFF );
		capture_select_set_led_status(auto_capture_index+6,  led_regs[auto_capture_index+6]| LED_STATUS_LED_OFF );
		
		if( auto_capture_index >= LED6 ){
			auto_capture_index = LED1;
			PMSG_send_msg( PC_TAG_DATA_LED_BRIGHTNESS , (unsigned char *)led_brightness , sizeof(led_brightness) ); 
		}else{
			auto_capture_index++;
		}
	}
	
	//capture_counter_check or the first time init , status = idel 
	if( capture_counter_status == CAPTURE_IDEL )
	{
		// init the tsc3200 
		res = capture_select_led(auto_capture_index , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON  ); // 1-6
		res += capture_select_led(auto_capture_index+6 , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON ); // 7-12
		if( res < 0 ) {
			// init led failed
			auto_capture_en = 0;
			PC_LOGE("init 74hc595 reg failed\n");
		}else{
			capture_counter_start();
		}
	}
}








//switchers control
#define SWITCHES_TESTMODE_ON_LEVEL 0
#define SWITCHES_TESTMODE_OFF_LEVEL 1
#define _SWITCHES_TESTMODE_S2(X) GPIO_WriteBit( GPIOB, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_S3(X) GPIO_WriteBit( GPIOA, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_S4(X) GPIO_WriteBit( GPIOA, GPIO_Pin_11 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)
#define _SWITCHES_TESTMODE_Sn(X) GPIO_WriteBit( GPIOC, GPIO_Pin_15 , X==1? SWITCHES_TESTMODE_ON_LEVEL:SWITCHES_TESTMODE_OFF_LEVEL)

void switches_testmode_S2()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(1);
}
void switches_testmode_S3()
{
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_S3(1);
}
void switches_testmode_S4()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_Sn(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_S4(1);
}
void switches_testmode_Sn()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_Sn(1);
}

void switches_testmode_off()
{
	_SWITCHES_TESTMODE_S3(0);
	_SWITCHES_TESTMODE_S4(0);
	_SWITCHES_TESTMODE_S2(0);
	_SWITCHES_TESTMODE_Sn(0);
}


#define SWITCHES_CHANNEL_ON_LEVEL 0
#define SWITCHES_CHANNEL_OFF_LEVEL 1
#define SWITCHES_S0(X) GPIO_WriteBit( GPIOA, GPIO_Pin_1 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S1(X) GPIO_WriteBit( GPIOA, GPIO_Pin_2 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S2(X) GPIO_WriteBit( GPIOA, GPIO_Pin_4 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_S3(X) GPIO_WriteBit( GPIOA, GPIO_Pin_5 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)
#define SWITCHES_EN(X) GPIO_WriteBit( GPIOA, GPIO_Pin_3 , X==1? SWITCHES_CHANNEL_ON_LEVEL:SWITCHES_CHANNEL_OFF_LEVEL)

int switches_channel_select(int channel)
{
	if( channel > 15 )
		return -1;
	
	SWITCHES_EN(1);
	systick_delay_ms(1);
	SWITCHES_S0(((channel>>0)&0x1));
	SWITCHES_S1(((channel>>1)&0x1));
	SWITCHES_S2(((channel>>2)&0x1));
	SWITCHES_S3(((channel>>3)&0x1));
	systick_delay_ms(1);
	SWITCHES_EN(0);
	return 0;
}

void switches_channel_off()
{
	SWITCHES_EN(1);
}


void switches_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	int i;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15 | GPIO_Pin_11 | GPIO_Pin_1| GPIO_Pin_2| GPIO_Pin_3| GPIO_Pin_4| GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	switches_channel_off();
	
	switches_testmode_off();

}














void cmd_even()
{
	unsigned char buffer[8];
	unsigned char i, len;
	
	len = Uart_Get(CONSOLE_UART,buffer,1);// USB_RxRead( buffer, 8 );
	
	if( len == 0 ) return;

	if( buffer[0] == 'd' ){
		debug_en = debug_en ? 0:1;
	}else if( buffer[0] == '0' ){

	}
}





void PC_msg_handler(PMSG_msg_t msg)
{
	int value,res;
	
	switch( msg.tag )
	{
		case PC_TAG_CMD_CAPTURE_EN:
			if( msg.data_len == 1 ){
				if( msg.data[0] == 0 ){
					capture_manual_mode();
				}else{
					capture_auto_mode();
				}
			}else{
				PC_LOGE("PC_TAG_CMD_CAPTURE_EN: unknow data");
			}
		break;
		
		case PC_TAG_CMD_LED_SELECT:
			capture_manual_mode();
			capture_reset_led_brightness();
			res = capture_select_led(msg.data[0]-1 , LED_STATUS_ENABLE | LED_STATUS_COLOR_CLEAR | LED_STATUS_FREQ_100 | LED_STATUS_LED_ON  );
			if( res == 0 ){
				PC_LOGI("PC_TAG_CMD_LED_SELECT: led%d start",msg.data[0]);
				capture_counter_start();
			}else{
				PC_LOGE("PC_TAG_CMD_LED_SELECT: failed");
			}
		break;
		
