RuanJG/stm32App/source/app/app_CSWL_LED_Monitor.c
		case PC_TAG_CMD_CAPTURE_INTERVAL:
			if( msg.data_len == 2 ){
				value = msg.data[0] | (msg.data[1]<<8) ;
				capture_set_interval( value );
				PC_LOGI("set capture interval %dms",value);
			}else{
				PC_LOGE("PC_TAG_CMD_CAPTURE_INTERVAL:  unknow data");
			}
		break;
			
		case PC_TAG_CMD_TEST:
			//PC_LOGI("reg=0x%02x",catpure_select_test(msg.data[0]));
		break;
		
		case PC_TAG_CMD_SWITCHES_TESTMODE:
			if( msg.data_len ==1 ){
				if( msg.data[0] == 0xff ){ 
					switches_testmode_off();
					PC_LOGI("switches testmode off");
				}else{
					switch ( msg.data[0] ){
						case 2:
							switches_testmode_S2();PC_LOGI("switches testmode S2");break;
						case 3:
							switches_testmode_S3();PC_LOGI("switches testmode S3");break;
						case 4:
							switches_testmode_S4();PC_LOGI("switches testmode S4");break;
						case 5:
							switches_testmode_Sn();PC_LOGI("switches testmode Sn");break;
						default:
							PC_LOGE("PC_TAG_CMD_SWITCHES_TESTMODE:  testmode should be in [2,5]");
						break;
					}
				}
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCHES_TESTMODE:  unknow data");
			}
		break;
		
		case PC_TAG_CMD_SWITCHES_CHANNEL:
			if( msg.data_len ==1 ){
				if( 0 > switches_channel_select(msg.data[0]) ){
					PC_LOGE("PC_TAG_CMD_SWITCHES_CHANNEL:  should be 0~15");
				}else{
					PC_LOGI("PC_TAG_CMD_SWITCHES_CHANNEL: channel %d ", msg.data[0]);
				}
			}else{
				PC_LOGE("PC_TAG_CMD_SWITCHES_CHANNEL:  unknow data");
			}
		break;
			
		default:
			break;
	}
	
}



void app_init()
{
	switches_init();
	Uart_USB_SWJ_init();
	PMSG_init(PC_UART, PC_msg_handler , NULL , NULL );
	capture_init();
	
	if( SystemCoreClock != 72000000 ){
		while(1);
	}
	
	PC_LOGI("Init OK");
}




volatile int led = 0;
void app_event()
{
	capture_loop();
	PMSG_even();
	cmd_even();
}

#endif //BOARD_CSWL_LED_MONITOR
